# ============================================================
# Customer Database Model
# ============================================================
#
# 这个文件负责定义：
# Customer 在数据库里如何保存。


from sqlalchemy import Column, String
from backend.database.connection import Base

import uuid


class Customer(Base):

    # 真正的数据库表名
    __tablename__ = "customers"


    # ========================================================
    # 1. Internal Database ID
    # ========================================================
    #
    # 数据库内部真正的唯一身份。
    #
    # UUID 的作用是保证技术层面不会冲突。
    id = Column(
        String,
        primary_key=True,
        default=lambda: str(uuid.uuid4())
    )


    # ========================================================
    # 2. Customer Code
    # ========================================================
    #
    # 给业务员、设计师、管理人员看的编号。
    #
    # 例如：
    # CUS-000001
    #
    # unique=True：
    # 数据库禁止两个 Customer 拥有同样的 code。
    #
    # 注意：
    # 我们下一步才会写自动生成 CUS-000001 的逻辑。
    customer_code = Column(
        String,
        unique=True,
        nullable=False
    )


    # ========================================================
    # 3. Customer Name
    # ========================================================

    customer_name = Column(
        String,
        nullable=False
    )


    # ========================================================
    # 4. Legal Name
    # ========================================================
    #
    # 正式公司注册名称。
    #
    # 允许为空。
    legal_name = Column(
        String,
        nullable=True
    )


    # ========================================================
    # 5. Customer Type
    # ========================================================

    customer_type = Column(
        String,
        nullable=False
    )


    # ========================================================
    # 6. Country
    # ========================================================

    country = Column(
        String,
        nullable=False
    )


    # ========================================================
    # 7. Website
    # ========================================================

    website = Column(
        String,
        nullable=True
    )


    # ========================================================
    # 8. Registration Number
    # ========================================================
    #
    # 企业注册号。
    #
    # 未来如果这个字段有值，
    # 可以作为非常强的重复客户判断依据。
    registration_number = Column(
        String,
        nullable=True
    )


    # ========================================================
    # 9. Notes
    # ========================================================

    notes = Column(
        String,
        nullable=True
    )
